//	??????䦶??????????????????????????????????????????

SNDCONFIG sndconfig[] =
{
	// ?????
	{    1, "data\\se\\sap_01.wav", 85, 0, 0 /*, "a?????"*/ },
	{    2, "data\\se\\sap_02.wav", 85, 0, 0 /*, "a??????"*/ },
	{    3, "data\\se\\sap_03.wav", 85, 0, 0 /*, "a??????"*/ },
	{    4, "data\\se\\sap_04.wav", 100, 0, 0 /*, "a????"*/ },
	{    5, "data\\se\\sap_05.wav", 85, 0, 0 /*, "a????"*/ },
	{    6, "data\\se\\sap_06.wav", 60, 0, 0 /*, "a?"*/ },
	{    7, "data\\se\\sap_07.wav", 123, 0, 0 /*, "a??????"*/ },
	{    8, "data\\se\\sap_08.wav", 80, 0, 0 /*, "?????"*/ },
	{    9, "data\\se\\sap_09.wav", 80, 0, 0 /*, "a??????"*/ },
	{   10, "data\\se\\sap_10.wav", 80, 0, 0 /*, "a???????"*/ },
//x	{   11, "data\\se\\sap_11.wav", 105, 7, 0 /*, "??"*/ },
	{   11, "data\\se\\sap_11.wav", 105, 0, 0 /*, "??"*/ },		   
	{   12, "data\\se\\sap_14.wav", 100, 0, 0 /*, "??"*/ },			 
	{   13, "data\\se\\sap_12.wav", 90, 0, 0 /*, "?????"*/ },	 	  
	{   14, "data\\se\\sap_13.wav", 105, 0, 0 /*, "??????"*/ },

	// ?????
	{   51, "data\\se\\sae_01.wav", 123, 0, 0 /*, ""*/ },
	{   52, "data\\se\\sae_02.wav", 123, 0, 0 /*, ""*/ },
	{   53, "data\\se\\sae_03.wav", 123, 0, 0 /*, ""*/ },
	{   54, "data\\se\\sae_04.wav", 123, 0, 0 /*, ""*/ },
	{   55, "data\\se\\sae_05.wav", 123, 0, 0 /*, ""*/ },
	{   56, "data\\se\\sae_06.wav", 105, 0, 0 /*, "?????"*/ },
	{   57, "data\\se\\sae_07.wav", 80, 0, 0 /*, "???????"*/ },
	{   58, "data\\se\\sae_08.wav", 123, 0, 0 /*, ""*/ },
	{   59, "data\\se\\sae_09.wav", 123, 0, 0 /*, ""*/ },
	{   60, "data\\se\\sae_10.wav", 80, 0, 0 /*, "????"*/ },
	{   61, "data\\se\\sae_11.wav", 123, 0, 0 /*, ""*/ },
	{   62, "data\\se\\sae_12.wav", 95, 0, 0 /*, "????"*/ },
	{   63, "data\\se\\sae_13.wav", 80, 0, 0 /*, "?????"*/ },
	{   64, "data\\se\\sae_14.wav", 90, 0, 0 /*, "???"*/ },
	{   65, "data\\se\\sae_15.wav", 95, 0, 0 /*, "?????"*/ },
	{   66, "data\\se\\sae_16.wav", 95, 0, 0 /*, "???"*/ },
	{   67, "data\\se\\sae_17.wav", 123, 0, 0 /*, ""*/ },
	{   68, "data\\se\\sae_18.wav", 123, 0, 0 /*, ""*/ },
	{   69, "data\\se\\sae_19.wav", 123, 0, 0 /*, ""*/ },
	{   70, "data\\se\\sae_20.wav", 123, 0, 0 /*, ""*/ },
	{   71, "data\\se\\sae_21.wav", 123, 0, 0 /*, ""*/ },
	{   72, "data\\se\\sae_22.wav", 123, 0, 0 /*, ""*/ },
	{   73, "data\\se\\sae_23.wav", 90, 0, 0 /*, "????"*/ },
	{   74, "data\\se\\sae_24.wav", 90, 0, 0 /*, "????"*/ },
	{   75, "data\\se\\sae_25.wav", 100, 0, 0 /*, "???"*/ },
	{   76, "data\\se\\sae_26.wav", 75, 0, 0 /*, "???"*/ },
	{   77, "data\\se\\sae_27.wav", 123, 0, 0 /*, ""*/ },
	{   78, "data\\se\\sae_28.wav", 90, 0, 0 /*, "????"*/ },
	{   79, "data\\se\\sae_29.wav", 123, 0, 0 /*, ""*/ },
	{   80, "data\\se\\sae_30.wav", 100, 0, 0 /*, "?????"*/ },
	{   81, "data\\se\\sae_31.wav", 123, 0, 0 /*, ""*/ },
	{   82, "data\\se\\sae_32.wav", 123, 0, 0 /*, ""*/ },

	// ?
	{  100, "data\\se\\sam_01.wav", 75, 0, 0 /*, "??????"*/ },
	{  101,	"data\\se\\sam_02.wav", 75, 0, 0 /*, "????"*/ },
	{  102,	"data\\se\\sam_03.wav", 75, 0, 0 /*, "??"*/ },
	{  103,	"data\\se\\sam_04.wav", 123, 0, 0 /*, "????"*/ },
	{  104,	"data\\se\\sam_05.wav", 123, 0, 0 /*, "?????"*/ },
	{  105,	"data\\se\\sam_06.wav", 123, 0, 0 /*, "????"*/ },
	{  106,	"data\\se\\sam_07.wav", 123, 0, 0 /*, "????"*/ },
	{  107,	"data\\se\\sam_08.wav", 123, 0, 0 /*, "?????"*/ },
	{  108,	"data\\se\\sam_09.wav", 123, 0, 0 /*, "????"*/ },
	{  109,	"data\\se\\sam_10.wav", 123, 0, 0 /*, "????"*/ },
	{  110,	"data\\se\\sam_11.wav", 123, 0, 0 /*, "?????"*/ },
	{  111,	"data\\se\\sam_12.wav", 123, 0, 0 /*, "????"*/ },
	{  112,	"data\\se\\sam_13.wav", 123, 0, 0 /*, "????"*/ },
	{  113,	"data\\se\\sam_14.wav", 123, 0, 0 /*, "?????"*/ },
	{  114,	"data\\se\\sam_15.wav", 85, 0, 0 /*, "?????????"*/ },
	{  115,	"data\\se\\sam_16.wav", 123, 0, 0 /*, "???"*/ },
	{  116,	"data\\se\\sam_17.wav", 123, 0, 0 /*, "?"*/ },
	{  117,	"data\\se\\sam_18.wav", 123, 0, 0 /*, "????"*/ },
	{  118,	"data\\se\\sam_19.wav", 123, 0, 0 /*, "??"*/ },
	{  119,	"data\\se\\sam_20.wav", 123, 0, 0 /*, "?"*/ },
	{  120,	"data\\se\\sam_21.wav", 123, 0, 0 /*, "?"*/ },
	{  121,	"data\\se\\sam_22.wav", 123, 0, 0 /*, ""*/ },
	{  122,	"data\\se\\sam_23.wav", 123, 0, 0 /*, "?"*/ },
	{  123,	"data\\se\\sam_24.wav", 123, 0, 0 /*, "?"*/ },

	// ??
//	{  151,	"data\\se\\sak_01.wav", 121, 0, 1 /*, "????"*/ },
//	{  152,	"data\\se\\sak_02.wav", 121, 0, 1 /*, "???⺌?"*/ },
	{  151,	"data\\se\\sak_01.wav", 127, 0, 1 /*, "?????"*/ },
//x	{  152,	"data\\se\\sak_02.wav", 127, 4, 1 /*, "?????"*/ },
	{  152,	"data\\se\\sak_02.wav", 127, 0, 1 /*, "?????"*/ },
	{  153,	"data\\se\\sak_03.wav", 121, 0, 1 /*, "?"*/ },
	{  154,	"data\\se\\sak_04.wav", 90, 0, 1 /*, "?"*/ },
	{  155,	"data\\se\\sak_05.wav", 95, 0, 1 /*, "?"*/ },
	{  156,	"data\\se\\sak_06.wav", 127, 0, 1 /*, "?䲡"*/ },
	{  157,	"data\\se\\sak_07.wav", 125, 0, 1 /*, "?????"*/ },
	{  158,	"data\\se\\sak_08.wav", 125, 0, 1 /*, "??????"*/ },
	{  159,	"data\\se\\sak_09a.wav", 120, 0, 1 /*, "?䲡?"*/ },
	{  160,	"data\\se\\sak_10.wav", 115, 0, 1 /*, "??䲡????"*/ },
	{  161,	"data\\se\\sak_11.wav",  85, 0, 1 /*, "?"*/ },
	{  162,	"data\\se\\sak_12.wav", 120, 0, 1 /*, "?"*/ },
	{  163,	"data\\se\\sak_13.wav", 100, 0, 1 /*, "???????"*/ },
	{  164,	"data\\se\\sak_14.wav", 127, 0, 1 /*, "??"*/ },
	{  165,	"data\\se\\sak_15.wav", 120, 0, 1 /*, "佋??"*/ },
	{  166,	"data\\se\\sak_16.wav", 120, 0, 1 /*, "????????"*/ },
	{  167,	"data\\se\\sak_17.wav", 110, 0, 1 /*, "??"*/ },
	{  168,	"data\\se\\sak_09b.wav", 120, 0, 1 /*, "?䲡???"*/ },

	// ????
	{  201,	"data\\se\\sas_01.wav", 90, 0, 0 /*, "???"*/ },
	{  202,	"data\\se\\sas_02.wav", 80, 0, 0 /*, "????????"*/ },
	{  203,	"data\\se\\sas_03.wav", 75, 0, 0 /*, "????????"*/ },
	{  204,	"data\\se\\sas_04.wav", 80, 0, 0 /*, "?????????"*/ },
	{  205,	"data\\se\\sas_05.wav", 80, 0, 0 /*, "?????????"*/ },
	{  206,	"data\\se\\sas_06.wav", 80, 0, 0 /*, "???????"*/ },
	{  207,	"data\\se\\sas_07.wav", 123, 0, 0 /*, ""*/ },
	{  208,	"data\\se\\sas_08.wav", 123, 0, 0 /*, ""*/ },
	{  209,	"data\\se\\sas_09.wav", 123, 0, 0 /*, ""*/ },
	{  210,	"data\\se\\sas_10.wav", 123, 0, 0 /*, ""*/ },
	{  211,	"data\\se\\sas_11.wav", 65, 0, 0 /*, ??????""*/ },
	{  212,	"data\\se\\sas_12.wav", 80, 0, 0 /*, "?????"*/ },
	{  213,	"data\\se\\sas_13.wav", 123, 0, 0 /*, "????"*/ },
//	{  214,	"data\\se\\sas_14.wav", 127, 0, 0 /*, "??"*/ },
	{  215,	"data\\se\\sas_15.wav", 82, 0, 0 /*, "??????"*/ },
	{  216,	"data\\se\\sas_16.wav", 110, 0, 0 /*, "?????"*/ },
	{  217,	"data\\se\\sas_17.wav", 85, 0, 0 /*, "????????"*/ },
	{  218,	"data\\se\\sas_18.wav", 123, 0, 0 /*, ""*/ },
	{  219,	"data\\se\\sas_19.wav", 82, 0, 0 /*, "?"*/ },
	{  220,	"data\\se\\sas_20.wav", 60, 0, 0 /*, "????"*/ },
	{  221,	"data\\se\\sas_21.wav", 123, 0, 0 /*, ""*/ },

	// ????
	{  250,	"data\\se\\sad_01.wav", 85, 0, 0 /*, "???????"*/ },
	{  251,	"data\\se\\sad_02.wav", 80, 0, 0 /*, "??????????"*/ },
//x	{  252,	"data\\se\\sad_03.wav", 95, -3, 0 /*, "????????"*/ },
	{  252,	"data\\se\\sad_03.wav", 95, 0, 0 /*, "????????"*/ },
	{  253,	"data\\se\\sad_04.wav", 85, 0, 0 /*, "????????"*/ },
	{  254,	"data\\se\\sad_05.wav", 90, 0, 0 /*, "???????"*/ },

#ifdef __ATTACK_MAGIC
	{  300,"data\\se\\saam_01.wav",120, 0, 0 /*, "前置魔法  魔法阵"*/ },
	{  301,"data\\se\\saam_02.wav",120, 0, 0 /*, "后置魔法  受伤图"*/ },
	{  302,"data\\se\\saam_03.wav",120, 0, 0 /*, "地魔法  魔法Lv1"*/ },
	{  303,"data\\se\\saam_04.wav",120, 0, 0 /*, "地魔法  魔法Lv2"*/ },
	{  304,"data\\se\\saam_05.wav",120, 0, 0 /*, "地魔法  魔法Lv3-1"*/ },
	{  305,"data\\se\\saam_06.wav",120, 0, 0 /*, "地魔法  魔法Lv3-2*/ },
	{  306,"data\\se\\saam_07.wav",120, 0, 0 /*, "地魔法  魔法Lv3-3*/ },
	{  307,"data\\se\\saam_08.wav",120, 0, 0 /*, "地魔法  魔法Lv4*/ },
	{  308,"data\\se\\saam_09.wav",120, 0, 0 /*, "水魔法  魔法Lv1"*/ },
	{  309,"data\\se\\saam_10.wav",120, 0, 0 /*, "水魔法  魔法Lv2"*/ },
	{  310,"data\\se\\saam_11.wav",120, 0, 0 /*, "水魔法  魔法Lv3-1"*/ },
	{  311,"data\\se\\saam_12.wav",120, 0, 0 /*, "水魔法  魔法Lv3-2"*/ },
	{  312,"data\\se\\saam_13.wav",120, 0, 0 /*, "水魔法  魔法Lv3-3"*/ },
	{  313,"data\\se\\saam_14.wav",120, 0, 0 /*, "水魔法  魔法Lv4"*/ },
	{  314,"data\\se\\saam_15.wav",120, 0, 0 /*, "火魔法  魔法Lv1"*/ },
	{  315,"data\\se\\saam_16.wav",120, 0, 0 /*, "火魔法  魔法Lv2"*/ },
	{  316,"data\\se\\saam_17.wav",120, 0, 0 /*, "火魔法  魔法Lv3-1"*/ },
	{  317,"data\\se\\saam_18.wav",120, 0, 0 /*, "火魔法  魔法Lv3-2"*/ },
	{  318,"data\\se\\saam_19.wav",120, 0, 0 /*, "火魔法  魔法Lv3-3"*/ },
	{  319,"data\\se\\saam_20.wav",120, 0, 0 /*, "火魔法  魔法Lv4"*/ },
	{  320,"data\\se\\saam_21.wav",120, 0, 0 /*, "风魔法  魔法Lv1"*/ },
	{  321,"data\\se\\saam_22.wav",120, 0, 0 /*, "风魔法  魔法Lv2"*/ },
	{  322,"data\\se\\saam_23.wav",120, 0, 0 /*, "风魔法  魔法Lv3-1"*/ },
	{  323,"data\\se\\saam_24.wav",120, 0, 0 /*, "风魔法  魔法Lv3-2"*/ },
	{  324,"data\\se\\saam_25.wav",120, 0, 0 /*, "风魔法  魔法Lv3-3"*/ },
	{  325,"data\\se\\saam_26.wav",120, 0, 0 /*, "风魔法  魔法Lv4"*/ },
	{  326,"data\\se\\saam_27.wav",120, 0, 0 /*, "魔王魔法  魔法Lv5"*/ },
#endif
#ifdef _NEWSOUNDEFFECT
	{  327,"data\\se\\sa1_01.wav",120, 0 ,0 } , //世界末日
	{  328,"data\\se\\sa1_02.wav",120, 0 ,0 } , //火龙枪
	{  371,"data\\se\\sa2_01.wav",120, 0 ,0 } , //回避
	{  372,"data\\se\\sa2_02.wav",120, 0 ,0 } , //激化攻击
	{  373,"data\\se\\sa2_03.wav",120, 0 ,0 } , //能量聚集
	{  374,"data\\se\\sa2_04.wav",120, 0 ,0 } , //专注战斗
	{  375,"data\\se\\sa2_05.wav",120, 0 ,0 } , //濒死攻击
	{  376,"data\\se\\sa2_06.wav",120, 0, 0 } , //勇士技能攻击命中十字光
	{  377,"data\\se\\sa2_07.wav",120, 0, 0 } , //贯穿攻击1
	{  378,"data\\se\\sa2_08.wav",120, 0, 0 } , //贯穿攻击2
	{  379,"data\\se\\sa2_09.wav",120, 0, 0 } , //回旋攻击1
	{  380,"data\\se\\sa2_10.wav",120, 0, 0 } , //回旋攻击2
	{  381,"data\\se\\sa3_01.wav",120, 0, 0 } , //追寻敌踪
	{  382,"data\\se\\sa3_02.wav",120, 0, 0 } , //树根缠绕
	{  383,"data\\se\\sa3_03.wav",120, 0, 0 } , //毒素武器
	{  384,"data\\se\\sa3_04.wav",120, 0, 0 } , //冰冻抗性
	{  385,"data\\se\\sa3_05.wav",120, 0, 0 } , //雷电抗性
	{  386,"data\\se\\sa3_06.wav",120, 0, 0 } , //火焰抗性放
	{  387,"data\\se\\sa3_07.wav",120, 0, 0 } , //火焰抗性中
	{  388,"data\\se\\sa1_03.wav",120, 0, 0 } , //电流术
	{  389,"data\\se\\sa1_04.wav",120, 0, 0 } , //召雷术
	{  390,"data\\se\\sa1_05.wav",120, 0, 0 } , //暴风雨大
	{  391,"data\\se\\sa1_06.wav",120, 0, 0 } , //冰箭术
	{  392,"data\\se\\sa1_07.wav",120, 0, 0 } , //冰爆术
	{  393,"data\\se\\sa1_08.wav",120, 0, 0 } , //冰镜术
	{  394,"data\\se\\sa1_09.wav",120, 0, 0 } , //暴风雨小
	{  395,"data\\se\\sa1_10.wav",120, 0, 0 } , //火山泉大
	{  396,"data\\se\\sa1_11.wav",120, 0, 0 } , //火山泉中
	{  397,"data\\se\\sa1_12.wav",120, 0, 0 } , //火山泉小
	{  398,"data\\se\\sa3_08.wav",120, 0, 0 } , //猎人使用
	{  399,"data\\se\\sa3_09.wav",120, 0, 0 } , //弱点攻击
	{  271,"data\\se\\sa1_13.wav",120, 0, 0 } , //一针见血

	{  261,"data\\se\\sa1_14.wav",120, 0, 0 } , //雷附体
	{  262,"data\\se\\sa1_15.wav",120, 0, 0 } , //冰火附体
	{  263,"data\\se\\sa1_16.wav",120, 0, 0 } , //嗜血蛊
	{  264,"data\\se\\sa1_17.wav",120, 0, 0 } , //附身术
	{  265,"data\\se\\sa1_18.wav",120, 0, 0 } , //嗜血成性10
	{  266,"data\\se\\sa1_19.wav",120, 0, 0 } , //嗜血成性7
	{  267,"data\\se\\sa1_20.wav",120, 0, 0 } , //嗜血成性4
	{  268,"data\\se\\sa1_21.wav",120, 0, 0 } , //嗜血成性1
	{  269,"data\\se\\sa1_22.wav",120, 0, 0 } , //火星球
	{  270,"data\\se\\sa1_23.wav",120, 0, 0 } , //移形换位
	{  272,"data\\se\\sa2_12.wav",120, 0, 0 } , //暴击气流



#endif
#ifdef _PROFESSION_ADDSKILL
	{  400,"data\\se\\sae_10.wav",120, 0, 0 } , //号召自然sak_92.wav
#endif
// BGM
//	{  401,	"data\\bgm\\ls2b_01.wav", 5 /*, "????????"*/ },
//	{  402,	"data\\bgm\\ls2b_02.wav", 5 /*, "??????"*/ },
//	{  403,	"data\\bgm\\ls2b_03.wav", 5 /*, "佋???"*/ },
//	{  404,	"data\\bgm\\ls2b_04.wav", 5 /*, "????"*/ },

#ifdef _FIREWORK_SOUND
	{  405,"data\\se\\sax_01.wav",120, 0, 0 } , //人型烟火音效
	{  406,"data\\se\\sax_02.wav",120, 0, 0 } , //宠型烟火音效
	{  407,"data\\se\\sax_03.wav",120, 0, 0 } , //愿藏烟火音效
#endif
	{  408,"data\\se\\sak_91.wav",120, 0, 0 } , //鸡年兽特效收录
	{  409,"data\\se\\sak_93.wav",120, 0, 0 } , //一角鲸特效收录	
	{  130,"data\\se\\sap_14.wav",100, 0, 0	} , //沧龙专用音效档	
	{  410,"data\\se\\sak_94.wav",120, 0, 0 } , //老鹰音效档
#ifdef _NPC_DANCE
	{  222,"data\\se\\sas_33.wav",120, 0, 0 } , //动一动新增音效1
	{  223,"data\\se\\sas_34.wav",120, 0, 0 } , //动一动新增音效2
	{  224,"data\\se\\sas_35.wav",120, 0, 0 } , //动一动新增音效3
#endif
	{ -1 }	// ??????????
};
